       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULAR-AREA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 LARGURA PIC 9(3) VALUE ZEROS.
           01 ALTURA PIC 9(3) VALUE ZEROS.
           01 RESULTADO PIC 9(6) VALUE ZEROS.
       PROCEDURE DIVISION.
       INICIO.
           DISPLAY "LARGURA: "
           ACCEPT LARGURA
           DISPLAY "ALTURA : "
           ACCEPT ALTURA
           MULTIPLY LARGURA BY ALTURA GIVING RESULTADO
           DISPLAY "AREA : " RESULTADO
           STOP RUN.
       END PROGRAM CALCULAR-AREA.
