       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIBONACCI.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 I              PIC 9(4) VALUE 0.
           77 FIRST-NUMBER   PIC 9(4) VALUE 0.
           77 SECOND-NUMBER  PIC 9(4) VALUE 1.
           77 TEMP-NUMBER    PIC 9(4) VALUE 1.
           77 DISPLAY-NUMBER PIC 9(4).

       PROCEDURE DIVISION.
       MOVE FIRST-NUMBER TO DISPLAY-NUMBER.
       DISPLAY DISPLAY-NUMBER.
       MOVE SECOND-NUMBER TO DISPLAY-NUMBER.
       DISPLAY DISPLAY-NUMBER.
       PERFORM VARYING I FROM 1 BY 1 UNTIL I = 8
           ADD FIRST-NUMBER TO SECOND-NUMBER GIVING TEMP-NUMBER
           MOVE SECOND-NUMBER TO FIRST-NUMBER
           MOVE TEMP-NUMBER TO SECOND-NUMBER
           MOVE TEMP-NUMBER TO DISPLAY-NUMBER
           DISPLAY DISPLAY-NUMBER
       END-PERFORM.
       STOP RUN.
