       IDENTIFICATION DIVISION.
       PROGRAM-ID. REPETICAO003.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 I PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       A.
           PERFORM B VARYING I FROM 1 BY 1 UNTIL I=5
       STOP RUN.

       B.
           DISPLAY I.
       END PROGRAM REPETICAO003.
