       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM B 5 TIMES.
       STOP RUN.

       B.
           DISPLAY 'FlashCLIP'.
       END PROGRAM YOUR-PROGRAM-NAME.
